{
  "posts": [
    {
      "id": "etFX6ZHHsTcC",
      "thumbnail": "http://books.google.com/books/content?id=etFX6ZHHsTcC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "title": "Building Web Apps for Google TV",
      "authors": [
        "Andres Ferrate",
        "Amanda Surya",
        "Daniels Lee",
        "Maile Ohye",
        "Paul Carff"
      ],
      "publisher": "\"O'Reilly Media, Inc.\"",
      "publishedDate": "2011-06-23",
      "categories": [
        "Computers"
      ],
      "description": "By integrating the Web with traditional TV, Google TV offers developers an important new channel for content. But creating apps for Google TV requires learning some new skills—in fact, what you may already know about mobile or desktop web apps isn't entirely applicable. Building Web Apps for Google TV will help you make the transition to Google TV as you learn the tools and techniques necessary to build sophisticated web apps for this platform. This book shows you how Google TV works, how it fits into the web ecosystem, and what the opportunities are for delivering rich content to millions of households. Discover the elements of a compelling TV web app, and what comprises TV-friendly navigation Learn the fundamentals for designing the 10-foot user experience Work with the Google Chrome browser on a TV display, and migrate an existing site Use examples for developing a TV web app, including the UI, controls, and scrolling Understand how to optimize, deliver, and protect video content for Google TV Help users discover your content by optimizing your site for Search—especially videos"
    },
    {
      "id": "DnIxCwAAQBAJ",
      "thumbnail": "http://books.google.com/books/content?id=DnIxCwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "title": "The Ugly Truth About Google Adwords",
      "authors": [
        "Thomas Schwartz"
      ],
      "publisher": "Lulu Press, Inc",
      "publishedDate": "2015-12-05",
      "categories": [
        "Computers"
      ],
      "description": "Google Adwords is one of the most promising advertising opportunities that abound in the Internet arena. It is a pay-per-click system that advertises websites which have the highest bids for a certain search word or phrase. If one would look at the window of an Internet browser and search something on the Google search engine, he will notice a section containing “sponsored links” at the right-hand side of the screen. These are the Adwords advertisements. These are websites which pay to be shown whenever a certain phrase or word is searched through Google. Discover everything you need to know by grabbing a copy of this ebook today."
    },
    {
      "id": "SZtsFe66zucC",
      "thumbnail": "http://books.google.com/books/content?id=SZtsFe66zucC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "title": "Google Apps: The Missing Manual",
      "authors": [
        "Nancy Conner"
      ],
      "publisher": "\"O'Reilly Media, Inc.\"",
      "publishedDate": "2008-05-27",
      "categories": [
        "Computers"
      ],
      "description": "Among its many amazing applications, Google now has web-based alternatives to many of the applications in Microsoft Office. This comprehensive and easy-to-follow new book enables you to explore Google's new office applications in detail. Once you do, you'll be in good company -- more than 100,000 small businesses and some corporations are already looking to take advantage of these free Google offerings. Google Apps: The Missing Manual teaches you how to use three relatively new applications from Google: \"Docs and Spreadsheets\", which provide many of the same core tools that you find in Word and Excel; and Google Calendar and Gmail, the applications that offer an alternative to Outlook. This book demonstrates how these applications together can ease your ability to collaborate with others, and allow you access to your documents, mail and appointments from any computer at any location. Of course, as remarkable as these applications are, Google's office suite is definitely a work-in-progress. Navigating what you can and can't do and -- more importantly -- understanding how to do it isn't always easy. And good luck finding enough help online. Google Apps: The Missing Manual is the one book you need to get the most out of this increasingly useful part of the Google empire. This book: Explains how to create, save and share each of Google's web-based office applications Offers separate sections for Docs and Spreadsheets, Google Calendar, and Gmail Demonstrates how to use these applications in conjunction with one another Gives you crystal-clear and jargon-free explanations that will satisfy users of all technical levels Many of you already use Gmail, but do you know its full potential? Do you know how you can increase its power by using Gmail with Doc and Spreadsheets and Google Calendar? You'll find out with Google Apps: The Missing Manual. You'll also come to understand why large corporations such as General Electric and Proctor & Gamble are taking a long, hard look at these applications."
    },
    {
      "id": "274fCwAAQBAJ",
      "thumbnail": "http://books.google.com/books/content?id=274fCwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "title": "Learning React Native",
      "authors": [
        "Bonnie Eisenman"
      ],
      "publisher": "\"O'Reilly Media, Inc.\"",
      "publishedDate": "2015-12-03",
      "categories": [
        "Computers"
      ],
      "description": "Get a practical introduction to React Native, the JavaScript framework for writing and deploying fully featured mobile apps that look and feel native. With this hands-on guide, you’ll learn how to build applications that target iOS, Android, and other mobile platforms instead of browsers. You’ll also discover how to access platform features such as the camera, user location, and local storage. With code examples and step-by-step instructions, author Bonnie Eisenman shows web developers and frontend engineers how to build and style interfaces, use mobile components, and debug and deploy apps. Along the way, you’ll build several increasingly sophisticated sample apps with React Native before putting everything together at the end. Learn how React Native provides an interface to native UI components Examine how the framework uses native components analogous to HTML elements Create and style your own React Native components and applications Install modules for APIs and features not supported by the framework Get tools for debugging your code, and for handling issues outside of JavaScript Put it all together with the Zebreto effective-memorization flashcard app Deploy apps to the iOS App Store and Google’s Play Store"
    },
    {
      "id": "brITEAAAQBAJ",
      "thumbnail": "http://books.google.com/books/content?id=brITEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "title": "365 Sports Cars You Must Drive",
      "authors": [
        "John Lamm",
        "Steve Sutcliffe",
        "Larry Edsall",
        "Kris Palmer",
        "James Mann"
      ],
      "publisher": "Motorbooks",
      "publishedDate": "2020-10-27",
      "categories": [
        "Sports cars"
      ],
      "description": "Sports cars are about the joy of driving and 365 Sports Cars You Must Drive: Fast, Faster, Fastest is a celebration of that pleasure. All the greats are included, from Alfa Romeo to Ferrari to MG to Triumph to Zenvo and just about every make model in between!"
    },
    {
      "id": "qbykAwAAQBAJ",
      "thumbnail": "http://books.google.com/books/content?id=qbykAwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "title": "My Google Apps",
      "authors": [
        "Patrice-Anne Rutledge",
        "Sherry Kinkoph Gunter"
      ],
      "publisher": "Que Publishing",
      "publishedDate": "2014-05-26",
      "categories": [
        "Computers"
      ],
      "description": "Full-color, step-by-step tasks walk you through doing exactly what you want with Google Apps. Learn how to: Use Google Apps to reduce technology expenses and grow your business Choose the best Google Apps version for your needs Quickly activate and customize your account Give your users customized email that uses your domain, not gmail.com Connect Gmail to your smartphone so your email and schedule always go with you Create, format, edit, print, and collaborate on documents with Docs Track and analyze your data with Sheets Create presentations with Slides and present anywhere via the Internet Cut travel costs: run video meetings online with Google Hangouts Improve project collaboration with a shared Sites workspace Efficiently manage and share your schedule with Calendar Store and share your files for secure anytime/anywhere access Sync your files between your PC or Mac and Google Drive in the cloud Use Vault to archive content and activity for compliance or other legal reasons Step-by-step instructions with callouts to new Google Apps screenshots that show you exactly what to do. Help when you run into Google Apps problemsor limitations. Tips and Notes to help you get the most from Google Apps."
    },
    {
      "id": "8MzovgEACAAJ",
      "thumbnail": "http://books.google.com/books/content?id=8MzovgEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
      "title": "Pro MERN Stack",
      "authors": [
        "Vasan Subramanian"
      ],
      "publisher": "Apress",
      "publishedDate": "2019-05-13",
      "categories": [
        "Computers"
      ],
      "description": "Assemble the complete stack required to build a modern web app using MongoDB, Express, React, and Node. This book also covers many other complementary tools: React Router, GraphQL, React-Bootstrap, Babel, and Webpack. This new edition will use the latest version of React (React 16) and the latest React Router (React Router 4), which has a significantly different approach to routing compared to React Router 2 which was used in the first edition of the book. Though the primary focus of Pro MERN Stack is to equip you with all that is required to build a full-fledged web application, a large portion of the book will be devoted to React 16. The popular MEAN (MongoDB, Express, AngularJS, Node) stack introduced Single Page Apps (SPAs) and front-end Model-View-Controller (MVC) as new and efficient paradigms. Facebook's React is a technology that competes indirectly with AngularJS. It is not a full-fledged MVC framework. It is a JavaScript library for building user interfaces (in some sense the View part). Yet, it is possible to build a web app by replacing AngularJS with React – hence the term MERN stack What You Will Learn Discover the features of React 16 to get the maximum out of this library Gain the basics of MongoDB, Express, and Node to build a web app Work with other libraries complementary to React, including React-Bootstrap, React Router, and GraphQL Use tools such as Babel and Webpack required to build JavaScript-based SPAs Tie all the components together to build a complete web app. Who This Book Is For Developers and architects who have prior experience in any web app stack other than the MERN stack will find the book useful to learn about this modern stack. Prior knowledge of JavaScript, HTML, and CSS is required."
    }
  ],
  "comments": [
    {
      "id": 1,
      "body": "some comment",
      "postId": "SZtsFe66zucC"
    },
    {
      "id": "SZtsFe66zucC",
      "body": "some comment",
      "postId": "SZtsFe66zucC"
    }
  ]
}